devdnl/dnx-rtos/src/system/drivers/irq/stm32f1/irq.c
/*=========================================================================*//**
@file    irq.c

@author  Daniel Zorychta

@brief   This driver support external interrupts (EXTI).

@note    Copyright (C) 2014  Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the  Free Software  Foundation;  either version 2 of the License, or
         any later version.

         This  program  is  distributed  in the hope that  it will be useful,
         but  WITHOUT  ANY  WARRANTY;  without  even  the implied warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         You  should  have received a copy  of the GNU General Public License
         along  with  this  program;  if not,  write  to  the  Free  Software
         Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.


*//*==========================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/driver.h"
#include "stm32f1/irq_cfg.h"
#include "stm32f1/stm32f10x.h"
#include "../irq_ioctl.h"

/*==============================================================================
  Local symbolic constants/macros
==============================================================================*/
#define NUMBER_OF_IRQs          16

/*==============================================================================
  Local types, enums definitions
==============================================================================*/
typedef struct {
        sem_t *irqsem[NUMBER_OF_IRQs];
} IRQ_t;

typedef struct {
        u8_t           priority;
        enum _IRQ_MODE mode;
} default_cfg_t;

/*==============================================================================
  Local function prototypes
==============================================================================*/
static enum IRQn EXTI_IRQ_number_to_NVIC_IRQn(uint EXTI_IRQ_n);
static void change_EXTI_IRQ_state(uint EXTI_IRQ_n, bool state);
static void set_EXTI_IRQ_priority(uint EXTI_IRQ_n, u32_t priority);
static void set_EXTI_edge_detector(uint EXTI_IRQ_n, bool falling, bool rising);
static inline void disable_EXTI_IRQ(uint EXTI_IRQ_n);
static inline void enable_EXTI_IRQ(uint EXTI_IRQ_n);
static bool IRQ_handler(uint EXIT_IRQ_n);

/*==============================================================================
  Local object definitions
==============================================================================*/
MODULE_NAME(IRQ);

static const default_cfg_t default_config[NUMBER_OF_IRQs] = {
        {.priority = _IRQ_LINE_0_PRIO,  .mode = _IRQ_LINE_0_MODE },
        {.priority = _IRQ_LINE_1_PRIO,  .mode = _IRQ_LINE_1_MODE },
        {.priority = _IRQ_LINE_2_PRIO,  .mode = _IRQ_LINE_2_MODE },
        {.priority = _IRQ_LINE_3_PRIO,  .mode = _IRQ_LINE_3_MODE },
        {.priority = _IRQ_LINE_4_PRIO,  .mode = _IRQ_LINE_4_MODE },
        {.priority = _IRQ_LINE_5_PRIO,  .mode = _IRQ_LINE_5_MODE },
        {.priority = _IRQ_LINE_6_PRIO,  .mode = _IRQ_LINE_6_MODE },
        {.priority = _IRQ_LINE_7_PRIO,  .mode = _IRQ_LINE_7_MODE },
        {.priority = _IRQ_LINE_8_PRIO,  .mode = _IRQ_LINE_8_MODE },
        {.priority = _IRQ_LINE_9_PRIO,  .mode = _IRQ_LINE_9_MODE },
        {.priority = _IRQ_LINE_10_PRIO, .mode = _IRQ_LINE_10_MODE},
        {.priority = _IRQ_LINE_11_PRIO, .mode = _IRQ_LINE_11_MODE},
        {.priority = _IRQ_LINE_12_PRIO, .mode = _IRQ_LINE_12_MODE},
        {.priority = _IRQ_LINE_13_PRIO, .mode = _IRQ_LINE_13_MODE},
        {.priority = _IRQ_LINE_14_PRIO, .mode = _IRQ_LINE_14_MODE},
        {.priority = _IRQ_LINE_15_PRIO, .mode = _IRQ_LINE_15_MODE}
};

static IRQ_t *IRQ;

/*==============================================================================
  Exported object definitions
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_INIT(IRQ, void **device_handle, u8_t major, u8_t minor)
{
        int result = ENODEV;

        if (major == 0 && minor == 0) {
                result = _sys_zalloc(sizeof(IRQ_t), device_handle);
                if (result == ESUCC) {
                        IRQ_t *hdl = *device_handle;

                        IRQ = hdl;

                        for (uint i = 0; i < NUMBER_OF_IRQs; i++) {
                                switch (default_config[i].mode) {
                                default:
                                case _IRQ_MODE_DISABLED:
                                        disable_EXTI_IRQ(i);
                                        break;

                                case _IRQ_MODE_FALLING_EDGE:
                                        set_EXTI_edge_detector(i, true, false);
                                        enable_EXTI_IRQ(i);
                                        break;

                                case _IRQ_MODE_RISING_EDGE:
                                        set_EXTI_edge_detector(i, false, true);
                                        enable_EXTI_IRQ(i);
                                        break;

                                case _IRQ_MODE_FALLING_AND_RISING_EDGE:
                                        set_EXTI_edge_detector(i, true, true);
                                        enable_EXTI_IRQ(i);
                                        break;
                                }

                                if (default_config[i].mode != _IRQ_MODE_DISABLED) {
                                        set_EXTI_IRQ_priority(i, default_config[i].priority);

                                        result = _sys_semaphore_create(1, 0, &hdl->irqsem[i]);
                                        if (result != ESUCC) {
                                                for (int s = 0; s < NUMBER_OF_IRQs; s++) {
                                                        disable_EXTI_IRQ(s);

                                                        if (hdl->irqsem[s]) {
                                                                _sys_semaphore_destroy(hdl->irqsem[s]);
                                                                hdl->irqsem[s] = NULL;
                                                        }
                                                }

