devdnl/dnx-rtos/src/system/drivers/irq/stm32f1/irq.c
                                                _sys_free(device_handle);
                                                IRQ = NULL;
                                        }
                                }
                        }
                }
        }

        return result;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_RELEASE(IRQ, void *device_handle)
{
        IRQ_t *hdl = device_handle;

        _sys_critical_section_begin();

        for (uint i = 0; i < NUMBER_OF_IRQs; i++) {
                disable_EXTI_IRQ(i);

                if (hdl->irqsem[i]) {
                        _sys_semaphore_destroy(hdl->irqsem[i]);
                        hdl->irqsem[i] = NULL;
                }
        }

        _sys_free(device_handle);
        IRQ = NULL;

        _sys_critical_section_end();

        return ESUCC;
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_OPEN(IRQ, void *device_handle, u32_t flags)
{
        UNUSED_ARG1(device_handle);
        UNUSED_ARG1(flags);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_CLOSE(IRQ, void *device_handle, bool force)
{
        UNUSED_ARG1(device_handle);
        UNUSED_ARG1(force);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *wrcnt                  number of written bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_WRITE(IRQ,
              void             *device_handle,
              const u8_t       *src,
              size_t            count,
              fpos_t           *fpos,
              size_t           *wrcnt,
              struct vfs_fattr  fattr)
{
        UNUSED_ARG6(device_handle, src, count, fpos, wrcnt, fattr);

        return ENOTSUP;
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *rdcnt                  number of read bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_READ(IRQ,
             void            *device_handle,
             u8_t            *dst,
             size_t           count,
             fpos_t          *fpos,
             size_t          *rdcnt,
             struct vfs_fattr fattr)
{
        UNUSED_ARG6(device_handle, dst, count, fpos, rdcnt, fattr);

        return ENOTSUP;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_IOCTL(IRQ, void *device_handle, int request, void *arg)
{
        UNUSED_ARG1(device_handle);

        IRQ_t *hdl = device_handle;

        int result = EINVAL;

        if (arg) {
                switch (request) {
                case IOCTL_IRQ__CATCH: {
                        const IRQ_catch_t *irqn = arg;
                        if (irqn->irq_number < NUMBER_OF_IRQs) {
                                if (hdl->irqsem[irqn->irq_number]) {
                                        result = _sys_semaphore_wait(hdl->irqsem[irqn->irq_number], irqn->timeout);
                                } else {
                                        return ENODEV;
                                }
                        }
                        break;
                }

                case IOCTL_IRQ__TRIGGER: {
                        const int irqn = reinterpret_cast(int, arg);
                        if (irqn < NUMBER_OF_IRQs) {
                                WRITE_REG(EXTI->SWIER, EXTI_SWIER_SWIER0 << irqn);
                                return ESUCC;
                        } else {
                                return EINVAL;
                        }

                        break;
                }

                case IOCTL_IRQ__CONFIGURE: {
                        const IRQ_config_t *cfg = arg;
                        if (cfg->irq_number < NUMBER_OF_IRQs) {
                                if (cfg->mode == IRQ_CONFIG_MODE__IRQ_DISABLED) {
                                        disable_EXTI_IRQ(cfg->irq_number);

                                        if (hdl->irqsem[cfg->irq_number]) {
                                                _sys_semaphore_destroy(hdl->irqsem[cfg->irq_number]);
                                                hdl->irqsem[cfg->irq_number] = NULL;
                                        }
                                } else {
                                        if (hdl->irqsem[cfg->irq_number] == NULL) {
                                                int result = _sys_semaphore_create(1, 0, &hdl->irqsem[cfg->irq_number]);
                                                if (result != ESUCC) {
                                                        return result;
                                                }
                                        }

                                        bool falling, rising;
                                        if (cfg->mode == IRQ_CONFIG_MODE__TRIGGER_ON_FALLING_EDGE) {
                                                falling = true;
                                                rising  = false;
                                        } else if (cfg->mode == IRQ_CONFIG_MODE__TRIGGER_ON_RISING_EDGE) {
                                                falling = false;
                                                rising  = true;
                                        } else if (cfg->mode == IRQ_CONFIG_MODE__TRIGGER_ON_FALLING_AND_RISING_EDGE) {
                                                falling = true;
                                                rising  = true;
                                        } else {
                                                falling = false;
                                                rising  = false;
                                        }

                                        set_EXTI_edge_detector(cfg->irq_number, falling, rising);
                                        enable_EXTI_IRQ(cfg->irq_number);
                                }

                                return ESUCC;
                        } else {
                                return EINVAL;
                        }
                        break;
                }

                default:
                        result = EBADRQC;
                }
        }

        return result;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_FLUSH(IRQ, void *device_handle)
{
        UNUSED_ARG1(device_handle);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_STAT(IRQ, void *device_handle, struct vfs_dev_stat *device_stat)
{
        UNUSED_ARG1(device_handle);

