devdnl/dnx-rtos/src/system/drivers/irq/stm32f1/irq.c
        bool woken = false;
        _sys_semaphore_signal_from_ISR(IRQ->irqsem[EXIT_IRQ_n], &woken);

        return woken;
}

//==============================================================================
/**
 * @brief EXTI0 IRQ Handler
 */
//==============================================================================
void EXTI0_IRQHandler(void)
{
        if (IRQ_handler(0)) {
                _sys_thread_yield_from_ISR();
        }
}

//==============================================================================
/**
 * @brief EXTI1 IRQ Handler
 */
//==============================================================================
void EXTI1_IRQHandler(void)
{
        if (IRQ_handler(1)) {
                _sys_thread_yield_from_ISR();
        }
}

//==============================================================================
/**
 * @brief EXTI2 IRQ Handler
 */
//==============================================================================
void EXTI2_IRQHandler(void)
{
        if (IRQ_handler(2)) {
                _sys_thread_yield_from_ISR();
        }
}

//==============================================================================
/**
 * @brief EXTI3 IRQ Handler
 */
//==============================================================================
void EXTI3_IRQHandler(void)
{
        if (IRQ_handler(3)) {
                _sys_thread_yield_from_ISR();
        }
}

//==============================================================================
/**
 * @brief EXTI4 IRQ Handler
 */
//==============================================================================
void EXTI4_IRQHandler(void)
{
        if (IRQ_handler(4)) {
                _sys_thread_yield_from_ISR();
        }
}

//==============================================================================
/**
 * @brief EXTI5-9 IRQ Handler
 */
//==============================================================================
void EXTI9_5_IRQHandler(void)
{
        bool woken = false;

        for (uint i = 5; i <= 9; i++) {
                woken |= IRQ_handler(i);
        }

        if (woken) {
                _sys_thread_yield_from_ISR();
        }
}

//==============================================================================
/**
 * @brief EXTI10-15 IRQ Handler
 */
//==============================================================================
void EXTI15_10_IRQHandler(void)
{
        bool woken = false;

        for (uint i = 10; i <= 15; i++) {
                woken |= IRQ_handler(i);
        }

        if (woken) {
                _sys_thread_yield_from_ISR();
        }
}

/*==============================================================================
  End of file
==============================================================================*/
